lihuanhuan/firmware/legacy/gd32_hard/system_gd32f470.c
  /* Reset HSEBYP bit */
  RCU_CTL &= ~(RCU_CTL_HXTALBPS);

  /* Reset CFG0 register */
  RCU_CFG0 = 0x00000000U;

  /* wait until IRC16M is selected as system clock */
  while (0 != (RCU_CFG0 & RCU_SCSS_IRC16M)) {
  }

  /* Reset PLLCFGR register */
  RCU_PLL = 0x24003010U;

  /* Disable all interrupts */
  RCU_INT = 0x00000000U;

  /* Configure the System clock source, PLL Multiplier and Divider factors,
      AHB/APBx prescalers and Flash settings */
  system_clock_config();
}
/*!
    \brief      configure the system clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_config(void) {
#ifdef __SYSTEM_CLOCK_IRC16M
  system_clock_16m_irc16m();
#elif defined(__SYSTEM_CLOCK_HXTAL)
  system_clock_hxtal();
#elif defined(__SYSTEM_CLOCK_120M_PLL_IRC16M)
  system_clock_120m_irc16m();
#elif defined(__SYSTEM_CLOCK_120M_PLL_8M_HXTAL)
  system_clock_120m_8m_hxtal();
#elif defined(__SYSTEM_CLOCK_120M_PLL_25M_HXTAL)
  system_clock_120m_25m_hxtal();
#elif defined(__SYSTEM_CLOCK_168M_PLL_IRC16M)
  system_clock_168m_irc16m();
#elif defined(__SYSTEM_CLOCK_168M_PLL_8M_HXTAL)
  system_clock_168m_8m_hxtal();
#elif defined(__SYSTEM_CLOCK_168M_PLL_25M_HXTAL)
  system_clock_168m_25m_hxtal();
#elif defined(__SYSTEM_CLOCK_200M_PLL_IRC16M)
  system_clock_200m_irc16m();
#elif defined(__SYSTEM_CLOCK_200M_PLL_8M_HXTAL)
  system_clock_200m_8m_hxtal();
#elif defined(__SYSTEM_CLOCK_200M_PLL_25M_HXTAL)
  system_clock_200m_25m_hxtal();
#elif defined(__SYSTEM_CLOCK_240M_PLL_IRC16M)
  system_clock_240m_irc16m();
#elif defined(__SYSTEM_CLOCK_240M_PLL_8M_HXTAL)
  system_clock_240m_8m_hxtal();
#elif defined(__SYSTEM_CLOCK_240M_PLL_25M_HXTAL)
  system_clock_240m_25m_hxtal();
#endif /* __SYSTEM_CLOCK_IRC16M */
}

#ifdef __SYSTEM_CLOCK_IRC16M
/*!
    \brief      configure the system clock to 16M by IRC16M
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_16m_irc16m(void) {
  uint32_t timeout = 0U;
  uint32_t stab_flag = 0U;

  /* enable IRC16M */
  RCU_CTL |= RCU_CTL_IRC16MEN;

  /* wait until IRC16M is stable or the startup time is longer than
   * IRC16M_STARTUP_TIMEOUT */
  do {
    timeout++;
    stab_flag = (RCU_CTL & RCU_CTL_IRC16MSTB);
  } while ((0U == stab_flag) && (IRC16M_STARTUP_TIMEOUT != timeout));

  /* if fail */
  if (0U == (RCU_CTL & RCU_CTL_IRC16MSTB)) {
    while (1) {
    }
  }

  /* AHB = SYSCLK */
  RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
  /* APB2 = AHB */
  RCU_CFG0 |= RCU_APB2_CKAHB_DIV1;
  /* APB1 = AHB */
  RCU_CFG0 |= RCU_APB1_CKAHB_DIV1;

  /* select IRC16M as system clock */
  RCU_CFG0 &= ~RCU_CFG0_SCS;
  RCU_CFG0 |= RCU_CKSYSSRC_IRC16M;

  /* wait until IRC16M is selected as system clock */
  while (0 != (RCU_CFG0 & RCU_SCSS_IRC16M)) {
  }
}

#elif defined(__SYSTEM_CLOCK_HXTAL)
/*!
    \brief      configure the system clock to HXTAL
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_hxtal(void) {
  uint32_t timeout = 0U;
  uint32_t stab_flag = 0U;

  /* enable HXTAL */
  RCU_CTL |= RCU_CTL_HXTALEN;

  /* wait until HXTAL is stable or the startup time is longer than
   * HXTAL_STARTUP_TIMEOUT */
  do {
    timeout++;
    stab_flag = (RCU_CTL & RCU_CTL_HXTALSTB);
  } while ((0U == stab_flag) && (HXTAL_STARTUP_TIMEOUT != timeout));

  /* if fail */
  if (0U == (RCU_CTL & RCU_CTL_HXTALSTB)) {
    while (1) {
    }
  }

  /* AHB = SYSCLK */
  RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
  /* APB2 = AHB */
  RCU_CFG0 |= RCU_APB2_CKAHB_DIV1;
  /* APB1 = AHB */
  RCU_CFG0 |= RCU_APB1_CKAHB_DIV1;

  /* select HXTAL as system clock */
  RCU_CFG0 &= ~RCU_CFG0_SCS;
  RCU_CFG0 |= RCU_CKSYSSRC_HXTAL;

  /* wait until HXTAL is selected as system clock */
  while (0 == (RCU_CFG0 & RCU_SCSS_HXTAL)) {
  }
}

#elif defined(__SYSTEM_CLOCK_120M_PLL_IRC16M)
/*!
    \brief      configure the system clock to 120M by PLL which selects IRC16M
   as its clock source \param[in]  none \param[out] none \retval     none
*/
static void system_clock_120m_irc16m(void) {
  uint32_t timeout = 0U;
  uint32_t stab_flag = 0U;

  /* enable IRC16M */
  RCU_CTL |= RCU_CTL_IRC16MEN;

  /* wait until IRC16M is stable or the startup time is longer than
   * IRC16M_STARTUP_TIMEOUT */
  do {
    timeout++;
    stab_flag = (RCU_CTL & RCU_CTL_IRC16MSTB);
  } while ((0U == stab_flag) && (IRC16M_STARTUP_TIMEOUT != timeout));

  /* if fail */
  if (0U == (RCU_CTL & RCU_CTL_IRC16MSTB)) {
    while (1) {
    }
  }

  RCU_APB1EN |= RCU_APB1EN_PMUEN;
  PMU_CTL |= PMU_CTL_LDOVS;

  /* IRC16M is stable */
  /* AHB = SYSCLK */
  RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
  /* APB2 = AHB/2 */
  RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
  /* APB1 = AHB/4 */
  RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

  /* Configure the main PLL, PSC = 16, PLL_N = 240, PLL_P = 2, PLL_Q = 5 */
  RCU_PLL = (16U | (240U << 6U) | (((2U >> 1U) - 1U) << 16U) |
             (RCU_PLLSRC_IRC16M) | (5U << 24U));

  /* enable PLL */
  RCU_CTL |= RCU_CTL_PLLEN;

  /* wait until PLL is stable */
  while (0U == (RCU_CTL & RCU_CTL_PLLSTB)) {
  }

  /* Enable the high-drive to extend the clock frequency to 120 Mhz */
  PMU_CTL |= PMU_CTL_HDEN;
  while (0U == (PMU_CS & PMU_CS_HDRF)) {
  }

  /* select the high-drive mode */
  PMU_CTL |= PMU_CTL_HDS;
  while (0U == (PMU_CS & PMU_CS_HDSRF)) {
  }

  /* select PLL as system clock */
  RCU_CFG0 &= ~RCU_CFG0_SCS;
  RCU_CFG0 |= RCU_CKSYSSRC_PLLP;

  /* wait until PLL is selected as system clock */
  while (0U == (RCU_CFG0 & RCU_SCSS_PLLP)) {
  }
}

#elif defined(__SYSTEM_CLOCK_120M_PLL_8M_HXTAL)
/*!
    \brief      configure the system clock to 120M by PLL which selects
   HXTAL(8M) as its clock source \param[in]  none \param[out] none \retval none
*/
static void system_clock_120m_8m_hxtal(void) {
  uint32_t timeout = 0U;
  uint32_t stab_flag = 0U;

  /* enable HXTAL */
  RCU_CTL |= RCU_CTL_HXTALEN;

  /* wait until HXTAL is stable or the startup time is longer than
   * HXTAL_STARTUP_TIMEOUT */
  do {
    timeout++;
    stab_flag = (RCU_CTL & RCU_CTL_HXTALSTB);
  } while ((0U == stab_flag) && (HXTAL_STARTUP_TIMEOUT != timeout));

