lihuanhuan/firmware/legacy/gd32_hard/system_gd32f470.c
  /* if fail */
  if (0U == (RCU_CTL & RCU_CTL_IRC16MSTB)) {
    while (1) {
    }
  }

  RCU_APB1EN |= RCU_APB1EN_PMUEN;
  PMU_CTL |= PMU_CTL_LDOVS;

  /* IRC16M is stable */
  /* AHB = SYSCLK */
  RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
  /* APB2 = AHB/2 */
  RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
  /* APB1 = AHB/4 */
  RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

  /* Configure the main PLL, PSC = 16, PLL_N = 480, PLL_P = 2, PLL_Q = 10 */
  RCU_PLL = (16U | (480U << 6U) | (((2U >> 1U) - 1U) << 16U) |
             (RCU_PLLSRC_IRC16M) | (10U << 24U));

  /* enable PLL */
  RCU_CTL |= RCU_CTL_PLLEN;

  /* wait until PLL is stable */
  while (0U == (RCU_CTL & RCU_CTL_PLLSTB)) {
  }

  /* Enable the high-drive to extend the clock frequency to 240 Mhz */
  PMU_CTL |= PMU_CTL_HDEN;
  while (0U == (PMU_CS & PMU_CS_HDRF)) {
  }

  /* select the high-drive mode */
  PMU_CTL |= PMU_CTL_HDS;
  while (0U == (PMU_CS & PMU_CS_HDSRF)) {
  }

  /* select PLL as system clock */
  RCU_CFG0 &= ~RCU_CFG0_SCS;
  RCU_CFG0 |= RCU_CKSYSSRC_PLLP;

  /* wait until PLL is selected as system clock */
  while (0U == (RCU_CFG0 & RCU_SCSS_PLLP)) {
  }
}

#elif defined(__SYSTEM_CLOCK_240M_PLL_8M_HXTAL)
/*!
    \brief      configure the system clock to 240M by PLL which selects
   HXTAL(8M) as its clock source \param[in]  none \param[out] none \retval none
*/
static void system_clock_240m_8m_hxtal(void) {
  uint32_t timeout = 0U;
  uint32_t stab_flag = 0U;

  /* enable HXTAL */
  RCU_CTL |= RCU_CTL_HXTALEN;

  /* wait until HXTAL is stable or the startup time is longer than
   * HXTAL_STARTUP_TIMEOUT */
  do {
    timeout++;
    stab_flag = (RCU_CTL & RCU_CTL_HXTALSTB);
  } while ((0U == stab_flag) && (HXTAL_STARTUP_TIMEOUT != timeout));

  /* if fail */
  if (0U == (RCU_CTL & RCU_CTL_HXTALSTB)) {
    while (1) {
    }
  }

  RCU_APB1EN |= RCU_APB1EN_PMUEN;
  PMU_CTL |= PMU_CTL_LDOVS;

  /* HXTAL is stable */
  /* AHB = SYSCLK */
  RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
  /* APB2 = AHB/2 */
  RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
  /* APB1 = AHB/4 */
  RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

  /* Configure the main PLL, PSC = 8, PLL_N = 480, PLL_P = 2, PLL_Q = 10 */
  RCU_PLL = (8U | (480U << 6U) | (((2U >> 1U) - 1U) << 16U) |
             (RCU_PLLSRC_HXTAL) | (10U << 24U));

  /* enable PLL */
  RCU_CTL |= RCU_CTL_PLLEN;

  /* wait until PLL is stable */
  while (0U == (RCU_CTL & RCU_CTL_PLLSTB)) {
  }

  /* Enable the high-drive to extend the clock frequency to 240 Mhz */
  PMU_CTL |= PMU_CTL_HDEN;
  while (0U == (PMU_CS & PMU_CS_HDRF)) {
  }

  /* select the high-drive mode */
  PMU_CTL |= PMU_CTL_HDS;
  while (0U == (PMU_CS & PMU_CS_HDSRF)) {
  }

  /* select PLL as system clock */
  RCU_CFG0 &= ~RCU_CFG0_SCS;
  RCU_CFG0 |= RCU_CKSYSSRC_PLLP;

  /* wait until PLL is selected as system clock */
  while (0U == (RCU_CFG0 & RCU_SCSS_PLLP)) {
  }
}

#elif defined(__SYSTEM_CLOCK_240M_PLL_25M_HXTAL)
/*!
    \brief      configure the system clock to 240M by PLL which selects
   HXTAL(25M) as its clock source \param[in]  none \param[out] none \retval none
*/
static void system_clock_240m_25m_hxtal(void) {
  uint32_t timeout = 0U;
  uint32_t stab_flag = 0U;

  /* enable HXTAL */
  RCU_CTL |= RCU_CTL_HXTALEN;

  /* wait until HXTAL is stable or the startup time is longer than
   * HXTAL_STARTUP_TIMEOUT */
  do {
    timeout++;
    stab_flag = (RCU_CTL & RCU_CTL_HXTALSTB);
  } while ((0U == stab_flag) && (HXTAL_STARTUP_TIMEOUT != timeout));

  /* if fail */
  if (0U == (RCU_CTL & RCU_CTL_HXTALSTB)) {
    while (1) {
    }
  }

  RCU_APB1EN |= RCU_APB1EN_PMUEN;
  PMU_CTL |= PMU_CTL_LDOVS;

  /* HXTAL is stable */
  /* AHB = SYSCLK */
  RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
  /* APB2 = AHB/2 */
  RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
  /* APB1 = AHB/4 */
  RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

  /* Configure the main PLL, PSC = 25, PLL_N = 480, PLL_P = 2, PLL_Q = 10 */
  RCU_PLL = (25U | (480U << 6U) | (((2U >> 1U) - 1U) << 16U) |
             (RCU_PLLSRC_HXTAL) | (10U << 24U));

  /* enable PLL */
  RCU_CTL |= RCU_CTL_PLLEN;

  /* wait until PLL is stable */
  while (0U == (RCU_CTL & RCU_CTL_PLLSTB)) {
  }

  /* Enable the high-drive to extend the clock frequency to 240 Mhz */
  PMU_CTL |= PMU_CTL_HDEN;
  while (0U == (PMU_CS & PMU_CS_HDRF)) {
  }

  /* select the high-drive mode */
  PMU_CTL |= PMU_CTL_HDS;
  while (0U == (PMU_CS & PMU_CS_HDSRF)) {
  }

  /* select PLL as system clock */
  RCU_CFG0 &= ~RCU_CFG0_SCS;
  RCU_CFG0 |= RCU_CKSYSSRC_PLLP;

  /* wait until PLL is selected as system clock */
  while (0U == (RCU_CFG0 & RCU_SCSS_PLLP)) {
  }
}
#endif /* __SYSTEM_CLOCK_IRC16M */
/*!
    \brief      update the SystemCoreClock with current core clock retrieved
   from cpu registers \param[in]  none \param[out] none \retval     none
*/
void SystemCoreClockUpdate(void) {
  uint32_t sws;
  uint32_t pllpsc, plln, pllsel, pllp, ck_src, idx, clk_exp;

  /* exponent of AHB, APB1 and APB2 clock divider */
  const uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

  sws = GET_BITS(RCU_CFG0, 2, 3);
  switch (sws) {
    /* IRC16M is selected as CK_SYS */
    case SEL_IRC16M:
      SystemCoreClock = IRC16M_VALUE;
      break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
      SystemCoreClock = HXTAL_VALUE;
      break;
    /* PLLP is selected as CK_SYS */
    case SEL_PLLP:
      /* get the value of PLLPSC[5:0] */
      pllpsc = GET_BITS(RCU_PLL, 0U, 5U);
      plln = GET_BITS(RCU_PLL, 6U, 14U);
      pllp = (GET_BITS(RCU_PLL, 16U, 17U) + 1U) * 2U;
      /* PLL clock source selection, HXTAL or IRC8M/2 */
      pllsel = (RCU_PLL & RCU_PLL_PLLSEL);
      if (RCU_PLLSRC_HXTAL == pllsel) {
        ck_src = HXTAL_VALUE;
      } else {
        ck_src = IRC16M_VALUE;
      }
      SystemCoreClock = ((ck_src / pllpsc) * plln) / pllp;
      break;
    /* IRC16M is selected as CK_SYS */
    default:
      SystemCoreClock = IRC16M_VALUE;
      break;
  }
  /* calculate AHB clock frequency */
  idx = GET_BITS(RCU_CFG0, 4, 7);
  clk_exp = ahb_exp[idx];
  SystemCoreClock = SystemCoreClock >> clk_exp;
}
